# Run with: brew bundle

cask_args appdir: '/Applications'

tap 'bramstein/webfonttools'
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/games'
tap 'homebrew/services'
tap 'homebrew/versions'
tap 'mattisg/mattisg'
cask 'java'
cask 'xquartz'
brew 'android-sdk'
brew 'md5sha1sum'
brew 'autoconf'
brew 'readline'
brew 'bash'
brew 'boost'
brew 'pcre'
brew 'git'
brew 'docker'
brew 'boot2docker'
brew 'coreutils'
brew 'libgpg-error'
brew 'libassuan'
brew 'libgcrypt'
brew 'libksba'
brew 'pth'
brew 'dirmngr'
brew 'findutils'
brew 'libpng'
brew 'freetype'
brew 'gdbm'
brew 'gnu-sed', args: ['with-default-names']
brew 'libusb'
brew 'pkg-config'
brew 'libusb-compat'
brew 'gnupg'
brew 'pinentry'
brew 'gpg-agent'
brew 'gnupg2'
brew 'lua'
brew 'highlight'
brew 'htop'
brew 'jpeg'
brew 'xz'
brew 'libtiff'
brew 'libtool'
brew 'webp'
brew 'imagemagick', args: ['with-webp']
brew 'libidn'
brew 'libogg'
brew 'libvorbis'
brew 'openssl'
brew 'sqlite'
brew 'python'
brew 'libxml2'
brew 'libxslt'
brew 'mas'
brew 'protobuf'
brew 'mobile-shell'
brew 'moreutils'
brew 'nmap'
brew 'node'
brew 'python3'
brew 'postgresql', restart_service: true
brew 'ruby-build'
brew 'rbenv'
brew 'redis'
brew 'rename'
brew 'sdl'
brew 'sdl_net'
brew 'sdl_sound', args: ['with-libogg', 'with-libvorbis']
brew 'ssh-copy-id'
brew 'the_silver_searcher'
brew 'tree'
brew 'vim', args: ['with-override-system-vi']
brew 'wget', args: ['with-iri']
brew 'zopfli'
brew 'bramstein/webfonttools/sfnt2woff'
brew 'bramstein/webfonttools/sfnt2woff-zopfli'
brew 'bramstein/webfonttools/woff2'
brew 'homebrew/dupes/grep'
brew 'homebrew/dupes/openssh'
brew 'homebrew/games/dosbox'
brew 'homebrew/versions/bash-completion2'
brew 'mattisg/mattisg/adblock'
cask 'alfred'
cask 'betterzipql'
cask 'firefox'
cask 'firefoxdeveloperedition'
cask 'gimp'
cask 'google-chrome'
cask 'google-drive'
cask 'hipchat'
cask 'inkscape'
cask 'iterm2'
cask 'jdownloader'
cask 'karabiner'
cask 'keepassx'
cask 'libreoffice'
cask 'macdown'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'scroll-reverser'
cask 'shiftit'
cask 'skype'
cask 'steam'
cask 'sublime-text'
cask 'suspicious-package'
cask 'teamspeak-client'
cask 'the-unarchiver'
cask 'thunderbird'
cask 'vagrant'
cask 'virtualbox'
cask 'viscosity' # OpenVPN
cask 'vlc'
cask 'webpquicklook'
cask "cheatsheet" # Hold CMD in any app for 3 seconds to display all hotkeys
mas 'Microsoft Remote Desktop', id: 715768417
mas 'PDFScanner', id: 410968114
mas 'Pixelmator', id: 407963104
mas 'Xcode', id: 497799835


# vim: ft=ruby
